[{"recordName":"Ghetto Gospel","recordPrice":"99.99","imageName":"58faaad3ddddc8.32754416.png","recordDescription":"This is one of those legendary records where 2pac give reflects of the Ghetto people. He has a remix on this joint with Elton John. It's definitely worth having a listen to it."},{"recordName":"Feeling Irie","recordPrice":"59.40","imageName":"58faab702cf181.87559682.png","recordDescription":"Stephen Marley goes in about his life as a stoner and Rastafarian. It's been on the reggae charts for 6 weeks. It's without a doubt a banging record. Check it out!"},{"recordName":"That's Not Me","recordPrice":"49.99","imageName":"58faabd430de57.32366873.png","recordDescription":"Skepta goes bar to bar with his competitors on this track. He made it clear once again that he is the one and only King of Grime. Every line on this track is either a bar or punchline. You can't afford to not hear it."},{"recordName":"Good Drank","recordPrice":"40","imageName":"58faac18c5ce63.92165330.png","recordDescription":"2 Chainz tells us about that good lifestyle again. Quavo and Gucci were on the beat. You know what that means, it definitely has that heat."},{"recordName":"Bank Roll","recordPrice":"149.99","imageName":"58faac7b92e0d0.30199932.png","recordDescription":"50 Cent tells us about that money lifestyle again. The hook on this joint is so hot right now that everyone on the streets is talking about it."},{"recordName":"Mo Carter","recordPrice":"99.99","imageName":"58ff79bfd241f5.10679835.png","recordDescription":"This is Mo Carter giving you those hard bars."},{"recordName":"One Love","recordPrice":"3","imageName":"5aeeb77047f3d2.39304866.png","recordDescription":"Just like the majority of his records, Bob Marley sings about love and leaving in a peace. A top notch you do not want to miss."},{"recordName":"Freedom","recordPrice":"2","imageName":"5aeeb7c885dc58.92552051.png","recordDescription":"Sizzla Kaloji said he is hotter than water and the world doubted him. I guess he has proven himself with this absolute banger."}]